<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */

    'failed' => 'Ці облікові дані не збігаються з нашими записами.',
    'password' => 'Введений пароль неправильний.',
    'throttle' => 'Забагато спроб входу. Будь ласка, спробуйте ще раз через :seconds секунд.',
    'login' => [
        'title' => 'Увійти до свого облікового запису',
        'description' => 'Введіть свою електронну адресу та пароль нижче для входу.',
        'forgot' => 'Забули пароль?',
        'remember_me' => 'Запам\'ятати мене',
    ],
    'verify_email' => [
        'description' => 'Будь ласка, підтвердьте свою електронну адресу, натиснувши на посилання, яке ми щойно надіслали вам.',
        'link_sent' => 'Нове посилання для підтвердження надіслано на електронну адресу, вказану під час реєстрації.',
        'resend' => 'Надіслати лист підтвердження повторно',
    ],
    'reset_password' => [
        'title' => 'Скинути пароль',
        'description' => 'Будь ласка, введіть новий пароль нижче.',
        'submit' => 'Скинути пароль',
    ],
    'confirm_password' => [
        'title' => 'Підтвердити пароль',
        'description' => 'Це захищена зона програми. Будь ласка, підтвердьте свій пароль перед тим, як продовжити.',
    ],
    'forgot_password' => [
        'title' => 'Забутий пароль',
        'description' => 'Введіть свою електронну адресу, щоб отримати посилання для скидання пароля.',
        'confirmation' => 'Посилання для скидання буде надіслано, якщо обліковий запис існує.',
        'return_to' => 'Або повернутися до',
        'submit' => 'Надіслати посилання для скидання',
    ],
];
