<?php

return [
    'dashboard' => [
        'title' => 'Огляд',
        'headline' => 'Глобальна статистика',
    ],
    'parcels' => [
        'title' => 'Посилки',
        'headline' => 'Всі посилки',
        'subtitle' => 'Додавайте, редагуйте та видаляйте посилки.',
        'form' => [
            'title' => 'Деталі посилки',
            'subtitle' => 'Заповніть інформацію нижче.',
            'extras' => [
                'recipient_warning' => 'Вибирайте отримувача лише якщо посилка буде відправлена окремо, а не на палеті!',
            ],
        ],
    ],
    'pallets' => [
        'title' => 'Палети',
        'headline' => 'Всі палети',
        'subtitle' => 'Додавайте, редагуйте та видаляйте палети.',
        'form' => [
            'title' => 'Деталі палети',
            'subtitle' => 'Заповніть інформацію нижче.',
        ],
    ],
    'transports' => [
        'title' => 'Транспорти',
        'headline' => 'Всі транспорти',
        'subtitle' => 'Додавайте, редагуйте та видаляйте транспорти.',
        'form' => [
            'title' => 'Деталі транспорту',
            'subtitle' => 'Заповніть інформацію нижче.',
        ],
    ],
    'content' => [
        'title' => 'Вміст',
        'headline' => 'Весь вміст',
        'subtitle' => 'Додавайте, редагуйте та видаляйте вміст посилок.',
        'form' => [
            'title' => 'Деталі вмісту',
            'subtitle' => 'Заповніть інформацію нижче.',
        ],
    ],
    'recipients' => [
        'title' => 'Отримувачі',
        'headline' => 'Всі отримувачі',
        'subtitle' => 'Додавайте, редагуйте та видаляйте отримувачів.',
        'form' => [
            'title' => 'Деталі отримувача',
            'subtitle' => 'Заповніть інформацію нижче.',
            'extras' => [
                'EDRPOU' => 'ЄДРПОУ',
            ],
        ],
    ],
    'users' => [
        'title' => 'Користувачі',
        'headline' => 'Всі користувачі',
        'subtitle' => 'Додавайте, редагуйте та видаляйте користувачів.',
        'form' => [
            'title' => 'Деталі користувача',
            'subtitle' => 'Заповніть інформацію нижче.',
            'extras' => [
                'password_warning' => 'Вводьте пароль у поле лише якщо хочете змінити поточний!',
            ],
        ],
    ],
    'settings' => [
        'title' => 'Налаштування',
        'headline' => 'Налаштування',
        'subtitle' => 'Керуйте своїм профілем та налаштуваннями облікового запису.',
        'subpages' => [
            'profile' => [
                'title' => 'Профіль',
                'headline' => 'Профіль',
                'subtitle' => 'Керуйте інформацією свого профілю.',
                'extras' => [
                    'email_unverified' => 'Вашу електронну адресу не підтверджено.',
                    'resend_verification' => 'Натисніть тут, щоб надіслати лист підтвердження повторно.',
                    'verification_sent' => 'Нове посилання для підтвердження надіслано на вашу електронну адресу.',
                ],
            ],
            'delete' => [
                'title' => 'Видалити обліковий запис',
                'subtitle' => 'Видалити свій обліковий запис та всі його ресурси',
                'modal' => [
                    'title' => 'Ви впевнені, що хочете видалити свій обліковий запис?',
                    'subtitle' => 'Після видалення облікового запису всі його ресурси та дані будуть остаточно видалені. Введіть свій пароль для підтвердження постійного видалення облікового запису.',
                ],
            ],
            'password' => [
                'title' => 'Пароль',
                'headline' => 'Оновити пароль',
                'subtitle' => 'Переконайтеся, що ваш обліковий запис використовує довгий випадковий пароль для безпеки.',
            ],
            'appearance' => [
                'title' => 'Зовнішній вигляд',
                'headline' => 'Зовнішній вигляд',
                'subtitle' => 'Оновіть налаштування зовнішнього вигляду свого облікового запису.',
                'extras' => [
                    'light' => 'Світла',
                    'dark' => 'Темна',
                    'system' => 'Системна',
                ],
            ],
        ],
    ],
];
