<?php

return [
    'user' => [
        'failed' => 'Не вдалося оновити користувача',
        'saved' => 'Користувача збережено!',
        'password' => [
            'failed' => 'Не вдалося оновити пароль',
            'saved' => 'Пароль оновлено!',
        ],
    ],
    'recipient' => [
        'failed' => 'Не вдалося зберегти отримувача',
        'saved' => 'Отримувача збережено!',
        'delete' => [
            'success' => 'Отримувача видалено!',
            'failed' => 'Не вдалося видалити отримувача',
        ],
    ],
    'content' => [
        'failed' => 'Не вдалося зберегти вміст',
        'saved' => 'Вміст збережено!',
        'duplicate' => 'Наданий вміст вже існує!',
        'delete' => [
            'success' => 'Вміст видалено!',
            'failed' => 'Не вдалося видалити вміст',
        ],
    ],
    'parcel' => [
        'failed' => 'Не вдалося зберегти посилку',
        'saved' => 'Посилку збережено!',
        'added' => 'Посилку успішно додано до списку',
        'already_added' => 'Цю посилку вже додано!',
        'loaded' => 'Посилку вже завантажено на палету або транспорт!',
        'no_recipient' => 'Посилка повинна мати отримувача перед додаванням до транспорту!',
        'not_found' => 'Посилку не знайдено в базі даних!',
        'delete' => [
            'success' => 'Посилку видалено!',
            'failed' => 'Не вдалося видалити посилку',
        ],
    ],
    'pallet' => [
        'failed' => 'Не вдалося зберегти палету',
        'saved' => 'Палету збережено!',
        'added' => 'Палету успішно додано до списку',
        'already_added' => 'Палету вже додано!',
        'loaded' => 'Палету вже завантажено на транспорт!',
        'no_recipient' => 'Палета повинна мати отримувача перед додаванням до транспорту!',
        'not_found' => 'Палету не знайдено в базі даних',
        'delete' => [
            'success' => 'Палету видалено!',
            'failed' => 'Не вдалося видалити палету',
        ],
    ],
    'transport' => [
        'failed' => 'Не вдалося зберегти транспорт',
        'saved' => 'Транспорт збережено!',
        'delete' => [
            'success' => 'Транспорт видалено!',
            'failed' => 'Не вдалося видалити транспорт',
        ],
    ],
    'label' => [
        'printing' => [
            'success' => 'Друк мітки успішно розпочато!',
            'failed' => 'Не вдалося розпочати друк мітки',
        ],
    ],
];
